cask_args appdir: '/Applications'

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "derailed/k9s"
tap "sokoloffa/radiola"

# Binaries
brew "coreutils"
brew "jq"
brew "ack"
brew "wget"
brew "htop"
brew "tree"
brew "ugit"
brew "thefuck"
brew "direnv"
brew 'git-delta'
brew "powerlevel10k"
brew "spaceman-diff"

# zsh
brew "zsh-history-substring-search"
brew "zsh-you-should-use"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"


# Development
brew "azure-cli"
brew "nvm"
brew "pyenv"
brew "kubernetes-cli"
brew "kubectx"
brew "derailed/k9s/k9s"
brew "helm"
brew "terraform"
brew "k3d"
brew "jupyter"

# Applications
cask "appcleaner"
cask "iterm2"
cask "fig"
cask "rectangle"
cask "maccy"
cask "shottr"
cask "google-chrome"
cask "spotify"
cask "visual-studio-code"
cask "notion"
cask "notion-calendar"
cask "docker"
cask "microsoft-teams"
cask "slack"
cask "readdle-spark"
cask "ngrok"
cask "radiola"
cask "swiftbar"
cask "istat-menus"
cask 'lens'
cask 'microsoft-remote-desktop'
cask 'azure-data-studio'
cask 'pgadmin4'

brew 'ollama'
cask 'lm-studio'