cask_args appdir: '/Applications'

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap 'derailed/k9s'

# Binaries
brew "jq"
brew "wget"
brew "htop"
brew "tree"
brew "ugit"
brew "thefuck"
brew "direnv"
brew 'git-delta'
brew "powerlevel10k"

# Development
brew "azure-cli"
brew "nvm"
brew "pyenv"
brew "kubernetes-cli"
brew "kubectx"
brew "derailed/k9s/k9s"

# Applications
cask "appcleaner"
cask "iterm2"
cask "fig"
cask "rectangle"
cask "maccy"
cask "shottr"
cask "google-chrome-canary"
cask "spotify"
cask "visual-studio-code"
cask "notion"
cask "notion-calendar"
cask "docker"
cask "microsoft-teams"
cask "slack"
cask "readdle-spark"
cask "ngrok"
cask "radiola"
cask "swiftbar"
cask "istat-menus"
cask 'lens'